FoamYade_lambda_box_lambdaDotModel_case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoamYade;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.;

deltaT          1e-06;

writeControl    runTime;

writeInterval   0.00005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //
